class Solution {
    public String solution(int[] food) {
        String answer = "";

        // 결과값 길이 (현재 상태는 중앙에 물이 하나 놓여져 있음)
        int length = 1;
        // 결과값 길이를 구하는 반복 (중앙에 물이 하나 이미 놨기 때문에 1부터 시작)
        for (int i = 1; i < food.length; i++) {
            // (food[i] / 2) - i번째 대결에서 한 선수가 먹을 갯수, 양 사이드를 반으로 나눠야 양쪽 각각의 사람 먹을 분량으로 나눠짐
            // *2 - 양쪽을 곱해서 두 선수 분량으로 만듬 -> 두 선수가 먹을 총 개수
            // food[i]로 총 개수를 구하면 되지 않냐? -> i번째에 food가 5개가 있다고 가정하자.
            // 한쪽은 3개, 다른 한쪽은 2개를 먹게 된다 -> 남는 1개는 제외해야 한다.
            // (대회의 조건을 고려하지 않고 음식을 주문하여 몇 개의 음식은 대회에 사용하지 못하게 되었습니다.)
            // 반면 짝수의 경우는 전부 배치한다. (짝수면 상관이 없는데 홀수인 경우가 있으므로 필요)
            length += (food[i] / 2) * 2;
        }

        // 음식의 배치를 나타내는 문자열 (char[]를 통해 배열 형태로 음식을 담는다.)
        // length만큼의 문자 배열을 만든다.
        char[] foodLane = new char[length];
        // 왼쪽에서 오른쪽으로 먹는 사람의 인덱스, 0부터 시작
        int left = 0;
        // 오른쪽에서 왼쪽으로 먹는 사람의 인덱스, 배열의 마지막 칸(length-1)부터 시작
        int right = length - 1;

        // 음식의 배치를 구하는 반복
        for (int i = 0; i < food.length; i++) {
            // 현재 i번째 대결에 준비된 음식의 갯수
            // (대회의 조건을 고려하지 않고 음식을 주문하여 몇 개의 음식은 대회에 사용하지 못하게 되었습니다.)
            int count = food[i] / 2;

            // i번째 대결의 음식을 왼쪽·오른쪽에 하나씩 넣는 작업
            // j - 반복 횟수를 세는 변수
            // j < count - 현재 대결에 준비된 음식 갯수만큼 (< count) 반복 횟수(count)가 도달하면 종료
            for (int j = 0; j < count; j++) {
                // ('0' + i) - 숫자 i에 해당하는 문자를 만들기 위한 계산
                // 음식 번호 i를 문자로 바꿔 왼쪽 칸에 넣고, left를 1 증가 (left++ - 현재 위치를 사용한 다음 증가)
                foodLane[left++] = (char) ('0' + i);
                // 음식 번호 i를 문자로 바꿔 오른쪽 칸에 넣고, right를 1 감소 (right-- - 현재 위치를 사용한 다음 감소)
                foodLane[right--] = (char) ('0' + i);
            }
            // count가 2면 양쪽 포인터 위치에 2가 들어간다. (왼쪽과 오른쪽 둘 다 2개씩 먹어야 한다는 뜻)
        }

        // 가운데 남은 한칸에 물을 넣는다. 물을 문자 '0'으로 표현
        // '결과값 길이를 구하는 반복'에서 결과값 길이를, 사용할 음식 개수 + 물 1개로 만들었다.
        // 음식을 모두 넣으면 중앙 한 칸만 남고 left == right가 된다.
        // 이제는 두 포인터가 같은 위치를 가리킨다. (foodLane[right] = '0';이라고 써도 결과가 같다.)
        foodLane[left] = '0';

        // 음식의 배치(foodLane)를 char 배열에서 String으로 변환
        answer = new String(foodLane);

        return answer;
    }
}
